//================================================================================================================================
void Display_write_level_PWM_1(int val_PWM)                 // 
{
  tft.fillRect(1, 1, 255, 8, TFT_BLACK);                    // Очистить 
  tft.drawRect(0, 0, 257, 10, TFT_WHITE);                   // Вывести квадрат
  tft.fillRect(1, 1, val_PWM, 8, TFT_YELLOW);               // Вывести уровень PWM
}
//================================================================================================================================
void Display_write_level_PWM_2(int val_PWM)                 // 
{
  tft.fillRect(1, 11, 255, 8, TFT_BLACK);                   // Очистить 
  tft.drawRect(0, 10, 257, 10, TFT_WHITE);                  // Вывести квадрат
  tft.fillRect(1, 11, val_PWM, 8, TFT_YELLOW);              // Вывести уровень PWM
}
//================================================================================================================================
void Display_write_level_PWM_3(int val_PWM)                 // 
{
  tft.fillRect(1, 21, 255, 8, TFT_BLACK);                   // Очистить 
  tft.drawRect(0, 20, 257, 10, TFT_WHITE);                  // Вывести квадрат
  tft.fillRect(1, 21, val_PWM, 8, TFT_YELLOW);              // Вывести уровень PWM
}
//================================================================================================================================