/*
__________________________________________________________________________________
| Датчик без адресации (один на линии) | Датчик с адресацией (несколько на линии) |
|______________________________________|__________________________________________|
| .setResolution(...) ~ 3591.125 мкс   | .setResolution(...) ~ 8276.0625 мкс 	    |
| .requestTemp() ~ 1839.9375 мкс	     | .requestTemp() ~ 6522.1875 мкс 		      |
|______________________________________|__________________________________________|
|							                С использованием CRC8								                |
|_________________________________________________________________________________|
| .readAddress(...) ~ 6467.3125 мкс	   | float .getTemp() ~ 12250.25 мкс	 	      | 
| float .getTemp() ~ 7620.25 мкс	     | int .getTemp() ~ 12250.2500 мкс 		      |	
| int .getTemp() ~ 7574.0625 мкс	     | 									                        |
|______________________________________|__________________________________________|
|							               Без использования CRC8								                |
|_________________________________________________________________________________|
| .readAddress(...) ~ 6394.3125 мкс    | float .getTemp() ~ 7809.1250 мкс	 	      |
| float .getTemp() ~ 3132.9375 мкс	   | int .getTemp() ~ 7809.1250 мкс	 		      |
| int .getTemp() ~ 3132.9375 мкс	     | 								  		                    |
|______________________________________|__________________________________________|

*/
//================================================================================================================================
#include <TFT_eSPI.h>										                    // Библиотека для дисплея TFT 3.5 480x320
#include <HX711_ADC.h>										                  // Библиотека для модуля HX711 (Датчик веса)
#include <EEPROM.h>											                    // Библиотека для памяти EEPROM
#include <DHT.h>                                            // Библиотека для памяти датчика температуры/влажность
#include <OneWire.h>                                        // Библиотека для подключения по одному проводу
#include <DallasTemperature.h>                              // Библиотека для полкчения значений с DS18B20
#include "Bitmap.h"                                         // Bitmaps
//================================================================================================================================
const int ONE_WIRE_BUS          =  0;                       // Пин для подключения DS18B20
const int TEMPERATURE_PRECISION =  9;                       // Колличество усреднений занчения DS18B20
//--------------------------------------------------------------------------------------------------------------------------------
const int DHTPIN                = 13;  							        // Пин для подключения лини данных для DHT 21 (AM2301)
//--------------------------------------------------------------------------------------------------------------------------------
const int HX711_dout            = 27;  							        // Пин для подключения лини данных для модуля HX711
const int HX711_sck             = 26;   						        // Пин для подключения лини синхронизации для модуля HX711
//--------------------------------------------------------------------------------------------------------------------------------
const int auger_motor           = 25;							          // Пин для подключения мотора "Шнек"
const int vibration_motor_1     = 33;							          // Пин для подключения первого мотора "Вибро"
const int vibration_motor_2     = 32;							          // Пин для подключения второго мотора "Вибро"
//================================================================================================================================
const int calVal_eepromAdress = 0;							            // Адрес EEPROM для коллибровочного значения
//--------------------------------------------------------------------------------------------------------------------------------
unsigned long t = 0;										                    // Таймер времени
//--------------------------------------------------------------------------------------------------------------------------------
float calibrationValue = 225.0;							                // Задаём коллибровочные значения
int serialPrintInterval = 100;						                  // Интервал времени запроса веса
int old_LoadCell = 0;                                       // 
//--------------------------------------------------------------------------------------------------------------------------------
bool flag_hx711         = false;									          // По умолчанию выключаем датчик HX711
bool flag_DS18B20_0     = false;                            // 
bool flag_DS18B20_1     = false;                            // 
bool flag_bitMap_hx711  = true;                             // 
//================================================================================================================================
TFT_eSPI tft = TFT_eSPI();									                // Объявляем объект для работы с дисплеем
//--------------------------------------------------------------------------------------------------------------------------------
DHT dht(DHTPIN, DHT21);                                     // Объявляем объект для работы с AM2301
//--------------------------------------------------------------------------------------------------------------------------------
HX711_ADC LoadCell(HX711_dout, HX711_sck);					        // Объявляем объект для работы с модулем HX711
//--------------------------------------------------------------------------------------------------------------------------------
OneWire oneWire(ONE_WIRE_BUS);                              // Объявляем объект для работы с одной линией
DallasTemperature sensors(&oneWire);                        // Объявляем объект для работы с DS18B20
DeviceAddress insideThermometer, outsideThermometer;        // Создаём переменные для хранения адресов DS18B20
//================================================================================================================================
void setup()												                        // 
{
  Serial.begin(115200);										                  // Настраиваем Serial
  Serial.setTimeout(10);                                    // Настроить время ожижания Serial
  //------------------------------------------------------------------------------------------------------------------------------
  tft.init();												                        // Инициализируем дисплей
  tft.setRotation(3);										                    // Устанавливаем Rotation для дисплея
  tft.fillScreen(TFT_BLACK);								                // Очищаем дисплей
  tft.setTextColor(TFT_WHITE, TFT_BLACK);					          // Установить цвет текста
  tft.setTextSize(1);									                      // Установить размер символов
  tft.setCursor(0, 0);								                      // Установить координату
  //------------------------------------------------------------------------------------------------------------------------------
  dht.begin();                                              // Инициализируем DHT
  //------------------------------------------------------------------------------------------------------------------------------
  pinMode(auger_motor, OUTPUT);									            // Настраиваем пин как выход
  pinMode(vibration_motor_1, OUTPUT);									      // Настраиваем пин как выход
  pinMode(vibration_motor_2, OUTPUT);									      // Настраиваем пин как выход
  //------------------------------------------------------------------------------------------------------------------------------
  Init_HX711();                                             // Инициализируем весовой датчик HX711
  Init_DS18B20();                                           // Инициализируем датчики температуры DS18B20
  Init_DHT();                                               // Инициализируем датчик DHT21
  //------------------------------------------------------------------------------------------------------------------------------
  delay(2000);                                              // Задержка инициализации
  //------------------------------------------------------------------------------------------------------------------------------
  tft.fillScreen(TFT_BLACK);								                // Очищаем дисплей
}
//================================================================================================================================
void loop()													                        // Гавный ЦиК-л
{
  printHumi(378, 300, 1);                                   // Вывести на дисплей Влажность
  printTemp(360, 310, 1);                                   // Вывести на дисплей Температуру
  Print_ds18b20();                                          // Вывести на дисплей Температуру (DS18B20)
  PrintLoad(200, 200);                                      // Вывести на дисплей вес
  //------------------------------------------------------------------------------------------------------------------------------
  if (Serial.available() > 0)								                // Если что-то пришло по Serial то...
  {
    SerialDebug();											                    // Вызвать отладку по Serial
  }
}
//================================================================================================================================