//================================================================================================================================
void SerialDebug()											                    // Дебаг
{
  char key = Serial.read();									                // Символ
  int val = Serial.parseInt();								              // Число
  //------------------------------------------------------------------------------------------------------------------------------
  tft.setTextSize(1);                                       // Установить размер текста
  tft.setTextColor(TFT_WHITE, TFT_BLACK);					          // Установить цвет текста
  //------------------------------------------------------------------------------------------------------------------------------
  switch (key)												                      // 
  {
    //----------------------------------------------------------------------------------------------------------------------------
    case 'q':												                        // 
		  if (val >= 0 && val < 256)                            // 
      {
        analogWrite(auger_motor, val);					            // 
        Display_write_level_PWM_1(val);                     // 
        tft.setCursor(0, 10);                               // 
        tft.print("s: ");                                   // 
        tft.println(val);                                   //
      }
		  break;												                        // 
    //----------------------------------------------------------------------------------------------------------------------------
    case 'a':                                               // 
      if (val >= 0 && val < 256)                            // 
      {
        analogWrite(vibration_motor_1, val);					      // 
        Display_write_level_PWM_2(val);                     // 
        tft.setCursor(0, 20);                               // 
        tft.print("d: ");                                   // 
        tft.println(val);                                   //
      }
      break;												                        // 
    //----------------------------------------------------------------------------------------------------------------------------
    case 'z':                                               // 
      if (val >= 0 && val < 256)                            // 
      {
        analogWrite(vibration_motor_2, val);					      // 
        Display_write_level_PWM_3(val);                     // 
        tft.setCursor(0, 30);                               // 
        tft.print("f: ");                                   // 
        tft.println(val);                                   //
      }
      break;                                                // 
    //----------------------------------------------------------------------------------------------------------------------------
    case 't':                                               // 
      LoadCell.tareNoDelay();                               // 
      while (LoadCell.getTareStatus()){}                    // 
      tft.setCursor(0, 10);                                 // 
      tft.print("Tare: ");                                  // 
      tft.println("Complite");                              //
      break;											                          // 
    //----------------------------------------------------------------------------------------------------------------------------
    case 'c':                                               // 
      calibrationValue = val;												        // 
      
      if (flag_hx711)                                       // 
      {
        LoadCell.setCalFactor(calibrationValue);            // Если датчи HX711 определен то задать коллибровочные значение
      }
      
      tft.setCursor(0, 0);                                  // 
      tft.print("calibrationValue: ");                      // 
      tft.println(calibrationValue);                        // 
      break;                                                //
    //----------------------------------------------------------------------------------------------------------------------------
    case 'i':                                               // 
      serialPrintInterval = val;												    // 
      tft.setCursor(0, 40);                                 // 
      tft.print("serialPrintInterval: ");                   // 
      tft.println(serialPrintInterval);                     // 
      break;                                                // 
    //----------------------------------------------------------------------------------------------------------------------------
  }
}
//================================================================================================================================